# 7 Unique Pandas functions to elevate your analysis

## What is Pandas?
Pandas is the top Python library used, especially in the data analytics process, for working with structured and semi-structured data to perform data maniputaltion and analysis tasks. From data cleaning to data visualization, it's your go to library for performing most of the tasks you need in your project.

It has two primary data structures:
- The 1D (Series) data structure
- The 2D (DataFrame) data structure

Pandas provides an extensive number of function, so it is essential to compile a short list of functions associated with Pandas DF or Pandas libray in general that are especially useful in analytics projects.

In [1]:
# Import Pandas library
import pandas as pd

## 1. .update()
It can be used in multiple ways, for example to describe a term called "Isolation and Fix".
For example, some rows in the month column of a dataset are inconsistend with the rest of the data, or some columns in these rowe differ from the gneral data. To address this, the rows should be extracted and correct all the issues, and then reintegrate the corredte rows back into the dataset.

In [2]:
# Sample data
data1 = pd.DataFrame({
    'month': ['Jan', 'Feb', 'Marh', 'Aprh'], 
    'value': [10, 20, 305, 405],
}, index = [1, 2, 3, 4])

In [3]:
# Extracte data
data2 = pd.DataFrame({
    'month': ['Marh', 'Aprh'], 
    'value': [305, 405],
}, index = [3, 4])

In [4]:
# Correcting the odd rows
data2 = pd.DataFrame({
    'month': ['Apr', 'Mar'],
    'value': [30, 40]
}, index=[3, 4])

In [5]:
# Update the original data with corrected values
data1.update(data2)

In [6]:
data1

  month  value
1   Jan     10
2   Feb     20
3   Apr     30
4   Mar     40

## 2. .apply()
This function is apowerful method used to apply a function along an axis of the DF or Series. It's highly versatile and can be used for a variety of operations, including applying custom functions, transforming data, and categorizing data, for example.

### a) Applying a function to each value in a column

In [7]:
# Sample data
data = pd.DataFrame({
    'A': [1, 2, 3], 
    'B': [4, 6, 5],
})

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

In [9]:
data['A'] = data['A'].apply(lambda x: str(x))

In [10]:
# Now column A is an object not and integer type
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      object
 1   B       3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

### b) Categorizing data for a new column

In [11]:
data = pd.DataFrame({
    'Age': [11, 14, 19, 51]
})

In [12]:
data['Category'] = data['Age'].apply(lambda x: 'Child' if x <= 12 else 
                                               'Teenager' if x <= 18 else 
                                               'Adult' if x > 20 else 'Young Adult')

In [13]:
data

   Age     Category
0   11        Child
1   14     Teenager
2   19  Young Adult
3   51        Adult

### c) Creating a new DF

In [14]:
# Sample data
data = pd.DataFrame({
    'A': [1, 2, 3], 
    'B': [4, 6, 5],
})

In [15]:
# Apply a lambda function to each element
data_squared = data.apply(lambda x: x**2)

In [16]:
data_squared

   A   B
0  1  16
1  4  36
2  9  25

## 3. .pipe()
This function allows you to apply a series of functions toa a DF or series in pipeline, quite similar to `%>%` in R. It helps to make the code more readable and maintainable by chaining operations together.

For example, let's assume the columns of a dataset are not in the correct scale, and I have to perform a series of operations to clean the data.

In [17]:
# Sample data
data = pd.DataFrame({
    'A': [10, 20, 30], 
    'B': [1, 2, 3],
})

In [18]:
data

    A  B
0  10  1
1  20  2
2  30  3

In [19]:
# Definition of functions
def multiply(df):
    df['A'] *= 100
    return df

def add(df):
    df['B'] = df['B'] + 10
    return df

In [20]:
# Adding 10 to values in B and multiplying values in A with 100
data.pipe(multiply) \
    .pipe(add) \
    .pipe(print)

# Both operations have been applied on the data in a single chain operation

      A   B
0  1000  11
1  2000  12
2  3000  13

## 4. pd.crosstab()
This function is one to use when working with categorical data. It generates a table that displays the frequency distribution of the intersection between two or more categorical variables.
The frequency it displays can either be the count of occurrences of combinations of values or proportions representing the data in term of percentage or relative frequency.

Let's assume I have a dataset containing road accident information with a gender column and an accident severity column, and I want to find information sucha as, "Are men involved in more serious accidents than woment?",  This is an approach that can be used to answer the question.

In [27]:
# Sample data
data = {
    'Accident_ID': range(1, 41),
    'Gender': ['M', 'M', 'M', 'F', 'M', 'M', 'M', 'F', 'M', 'F',
               'M', 'M', 'M', 'F', 'M', 'M', 'M', 'F', 'M', 'F',
               'M', 'M', 'M', 'F', 'M', 'M', 'M', 'F', 'M', 'F',
               'M', 'F', 'M', 'F', 'M', 'F', 'M', 'M', 'M', 'F'],
    'Severity': ['Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight',
                 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight',
                 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight',
                 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious', 'Fatal', 'Slight', 'Serious']
}

In [29]:
# Create DataFrame
df = pd.DataFrame(data)
df.head(3)

   Accident_ID Gender Severity
0            1      M   Slight
1            2      M  Serious
2            3      M    Fatal

In [34]:
# Give the frequency as count of occurence
crossdf = pd.crosstab(df['Severity'], df['Gender'])
crossdf = crossdf.reset_index()
crossdf

Gender Severity  F   M
0         Fatal  1  11
1       Serious  5   8
2        Slight  7   8

In [35]:
# Gives frequency as proportion
crossdf = pd.crosstab(df['Severity'], df['Gender'], normalize = 'index')
crossdf = crossdf.reset_index()
crossdf

Gender Severity         F         M
0         Fatal  0.083333  0.916667
1       Serious  0.384615  0.615385
2        Slight  0.466667  0.533333

## .pct_change()
This function calculates the percentage change between the current and a prior element along a given axis. It is useful for analysing the relative changes in data, such as financial or time series data.
A relatively simple but very useful function used in trend analysis to show changes over time. Let's assume we have a dataset containing monthly sales figures. Here's how we can calculate the % change.

In [36]:
data = pd.DataFrame({
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Sales': [2000, 2200, 2100, 2500, 2700]
})

In [37]:
# Set month as index
data.set_index('Month', inplace=True)

In [40]:
# Calculate percentage change
data['Sales Change (%)'] = round((data['Sales'].pct_change() * 100), 2)
# Each row in the Sales change column represent by how much sales figures incresed since last month
data

       Sales  Sales Change (%)
Month
Jan     2000               NaN
Feb     2200             10.00
Mar     2100             -4.55
Apr     2500             19.05
May     2700              8.00

## 6. .get_dummies()
This function is used to convert categorical data into a format that can be fed into a ML algorithm for data modelling, a technique popularly knowh as "one-hot encoding". This is typically done by converting categorical variables into a series of binary (0, 1) or boolean (T, F) columns.

If tempted to ask of what use is this when sckikit-learn has a label encoder function that performs similar tasks, thses two functions are quite different. . get_dummies() is preferred for non-ordinal data since it avoids implying any order among categories. On the other hand, LabelEncoder is a more compact and suitable for ordinal data such as education level which has an ordered relationship (Middle School - Hich School - University).

Let's assume I have column continaing answers to a question whcih is either y/n, .get_dummies() will create new columns, one for each category. Each row in these new columns will have a 1 in the column correcponding to its category and 0 int he others.

In [41]:
# Sample DF with a categorical column
data = pd.DataFrame({
    'Answer': ['yes', 'no', 'no', 'yes', 'no']
})

In [42]:
# Convert categorical column to dummy variables
dummies = pd.get_dummies(data['Answer'])

In [43]:
dummies

      no    yes
0  False   True
1   True  False
2   True  False
3  False   True
4   True  False

## 7. .combine_first()
It is used to combine two dfs by filling in missing values  in ona df with values from another. It's partivcularly useful when you have 2 datsets that complement each other and wnat to create a complete dataset by merging them.

Quite similar to the .merge() function, one of the differences it that it automatically includes all distingc columns from both dfs and aligns them based on their common columns, filling missing values int he first df with corresponding values from the second. It can be used interchangeably with .merge() depending on your use case.

Now, let's assume a company that collects employee performance data from two departments, HR and Sales. Both departments track employee data, but they focus on different aspects. If I want to analyze HR data but discover some values were missing and I also need additional information from Sales.

In [44]:
# HR Data (data1)
data1 = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Department': ['HR', 'Sales', 'HR', None],
    'Salary': [60000, 55000, 58000, 62000],
})
data1

   EmployeeID     Name Department  Salary
0         101    Alice         HR   60000
1         102      Bob      Sales   55000
2         103  Charlie         HR   58000
3         104    David       None   62000

In [45]:
# Sales Data (data2)
data2 = pd.DataFrame({
    'EmployeeID': [101, 102, 104, 105],
    'SalesTarget': [50000, 70000, 65000, 80000],
    'SalesAchieved': [48000, 75000, 66000, 81000],
    'Department': ['HR', None, 'Sales', 'Sales']
})
data2

   EmployeeID  SalesTarget  SalesAchieved Department
0         101        50000          48000         HR
1         102        70000          75000       None
2         104        65000          66000      Sales
3         105        80000          81000      Sales

In [50]:
# Comine using combine_first()
combined_data = data1.set_index('EmployeeID').combine_first(data2.set_index('EmployeeID')).reset_index()
combined_data

   EmployeeID Department     Name   Salary  SalesAchieved  SalesTarget
0         101         HR    Alice  60000.0        48000.0      50000.0
1         102      Sales      Bob  55000.0        75000.0      70000.0
2         103         HR  Charlie  58000.0            NaN          NaN
3         104      Sales    David  62000.0        66000.0      65000.0
4         105      Sales      NaN      NaN        81000.0      80000.0